tutorials/fluidSolidInteraction/beamInCrossFlow/elastoPlasticBeamInCrossFlow/constant/solid/plasticStrainVsYieldStress
(
    ( 0    500 )
)